In [1]:
import sqlite3
import pandas as pd

In [2]:
conn = sqlite3.connect('students.db')
cur = conn.cursor()

In [3]:
def display_as_table(data, headers):
    df = pd.DataFrame(data=data, columns=[i[0] for i in headers])
    return df

In [4]:
cur.execute("SELECT * FROM Students")

In [5]:
display_as_table(cur.fetchall(), cur.description)

     Name  GPA        Major  Year
0    Yoda  3.8  Mathematics     3
1    Yoda  3.8  Mathematics     3
2    Yoda  3.8  Mathematics     3
3   Vader  NaN  Mathematics     1
4     Rey  3.9      Physics     2
5    Kylo  2.9      History     3
6   Snoke  3.5          Art     4
7    Finn  3.2          Art     3
8     Han  3.7  Mathematics     2
9    Luke  3.0      History     1
10   Maul  NaN  Mathematics     1

In [6]:
cur.execute('''
SELECT Major, COUNT(*) as NumsStudent, AVG(GPA) as AvgGPA
FROM Students
GROUP BY Major
''')
display_as_table(cur.fetchall(), cur.description)

         Major  NumsStudent  AvgGPA
0          Art            2   3.350
1      History            2   2.950
2  Mathematics            6   3.775
3      Physics            1   3.900

In [8]:
cur.execute('''
CREATE VIEW MajorInfo AS
SELECT Major, COUNT(*) as NumsStudent, AVG(GPA) as AvgGPA
FROM Students
GROUP BY Major
''')

In [9]:
cur.execute("SELECT * FROM MajorInfo")
display_as_table(cur.fetchall(), cur.description)

         Major  NumsStudent  AvgGPA
0          Art            2   3.350
1      History            2   2.950
2  Mathematics            6   3.775
3      Physics            1   3.900

In [10]:
cur.execute("INSERT INTO Students VALUES('R2D2',3.9, 'Art', 2)")

In [11]:
cur.execute("SELECT * FROM MajorInfo")
display_as_table(cur.fetchall(), cur.description)

         Major  NumsStudent    AvgGPA
0          Art            3  3.533333
1      History            2  2.950000
2  Mathematics            6  3.775000
3      Physics            1  3.900000

In [12]:
#This is super simple, allows private, and is super quick when people need it

In [13]:
cur.execute("DROP VIEW MajorInfo")

In [14]:
cur.execute("SELECT * FROM MajorInfo")
display_as_table(cur.fetchall(), cur.description)

OperationalError: no such table: MajorInfo